Repository: microsoft/PowerToys
Catalog: src/modules/powerrename/PowerRenameUILib/Strings/*/Resources.resw
Source language: en_us
Languages: vi

# SearchBox.PlaceholderText
source: Search for
vi: Tìm kiếm

# RegExCheatSheet_Title.Text
source: RegEx help
vi: Trợ giúp RegEx

# RegExCheatSheet_StartOfString
source: Start of the string
vi: Bắt đầu chuỗi

# RegExCheatSheet_EndOfString
source: End of the string
vi: Kết thúc chuỗi

# RegExCheatSheet_MatchAny
source: Matches any character
vi: Khớp với bất kỳ ký tự nào

# RegExCheatSheet_ZeroOrOne
source: Matches zero or one of the preceding token
vi: Khớp với 0 hoặc 1 lần của token trước đó

# RegExCheatSheet_ZeroOrMore
source: Matches zero or more of the preceding token
vi: Khớp với 0 hoặc nhiều lần của token trước đó

# RegExCheatSheet_OneOrMore
source: Matches one or more of the preceding token
vi: Khớp với 1 hoặc nhiều lần của token trước đó

# RegExCheatSheet_MatchDigit
source: Any digit, short for [0-9]
vi: Bất kỳ chữ số nào, viết tắt của [0-9]

# RegExCheatSheet_MatchNonDigit
source: A non-digit, short for [^0-9]
vi: Ký tự không phải chữ số, viết tắt của [^0-9]

# RegExCheatSheet_MatchWS
source: Any whitespace character
vi: Bất kỳ ký tự khoảng trắng nào

# RegExCheatSheet_MatchNonWS
source: A non-whitespace character, short for [^\s]
vi: Ký tự không phải khoảng trắng, viết tắt của [^\s]

# RegExCheatSheet_MatchWordChar
source: A word character, short for [a-zA-Z_0-9]
vi: Ký tự từ, viết tắt của [a-zA-Z_0-9]

# RegExCheatSheet_MatchWordBoundary
source: Matches a word boundary where a word character is [a-zA-Z0-9_].
vi: Khớp với ranh giới từ nơi ký tự từ là [a-zA-Z0-9_].

# RegExCheatSheet_LearnMore.Text
source: Learn more about RegEx
vi: Tìm hiểu thêm về RegEx

# ReplaceBox.PlaceholderText
source: Replace with
vi: Thay thế bằng

# CounterCheatSheet_Title.Text
source: Replace using advanced counter syntax
vi: Thay thế bằng cú pháp bộ đếm nâng cao

# CounterCheatSheet_Simple
source: A simple counter that you can use anywhere in a replace string.
vi: Một bộ đếm đơn giản có thể dùng ở bất kỳ đâu trong chuỗi thay thế.

# CounterCheatSheet_Start
source: A counter with a customized start value.
vi: Bộ đếm với giá trị bắt đầu tùy chỉnh.

# CounterCheatSheet_Increment
source: A counter with a customized increment value.
vi: Bộ đếm với giá trị tăng tùy chỉnh.

# CounterCheatSheet_Padding
source: A counter with a customized number of leading padding zeroes.
vi: Bộ đếm với số chữ số 0 đệm đầu tùy chỉnh.

# CounterCheatSheet_Complex
source: A counter showing multiple customized properties.
vi: Bộ đếm hiển thị nhiều thuộc tính tùy chỉnh.

# DateTimeCheatSheet_Title.Text
source: Replace using file creation date and time
vi: Thay thế bằng ngày giờ tạo tệp

# DateTimeCheatSheet_FullYear
source: Year represented by a full four or five digits, depending on the calendar used.
vi: Năm được biểu diễn bằng bốn hoặc năm chữ số đầy đủ, tùy theo lịch dùng.

# DateTimeCheatSheet_YearLastTwoDigits
source: Year represented only by the last two digits. A leading zero is added for single-digit years.
vi: Năm chỉ bằng hai chữ số cuối. Thêm 0 ở đầu cho năm một chữ số.

# DateTimeCheatSheet_YearLastDigit
source: Year represented only by the last digit.
vi: Năm chỉ bằng chữ số cuối.

# DateTimeCheatSheet_MonthName
source: Name of the month.
vi: Tên tháng.

# DateTimeCheatSheet_MonthNameAbbr
source: Abbreviated name of the month.
vi: Tên tháng viết tắt.

# DateTimeCheatSheet_MonthDigitLZero
source: Month as digits with leading zeros for single-digit months.
vi: Tháng dạng số có thêm 0 ở đầu cho tháng một chữ số.

# DateTimeCheatSheet_MonthDigit
source: Month as digits without leading zeros for single-digit months.
vi: Tháng dạng số không thêm 0 ở đầu cho tháng một chữ số.

# DateTimeCheatSheet_DayName
source: Name of the day of the week.
vi: Tên thứ trong tuần.

# DateTimeCheatSheet_DayNameAbbr
source: Abbreviated name of the day of the week.
vi: Tên thứ trong tuần viết tắt.

# DateTimeCheatSheet_DayDigitLZero
source: Day of the month as digits with leading zeros for single-digit days.
vi: Ngày trong tháng dạng số có thêm 0 ở đầu cho ngày một chữ số.

# DateTimeCheatSheet_DayDigit
source: Day of the month as digits without leading zeros for single-digit days.
vi: Ngày trong tháng dạng số không thêm 0 ở đầu cho ngày một chữ số.

# DateTimeCheatSheet_MinutesLZero
source: Minutes with leading zeros for single-digit minutes.
vi: Phút có thêm 0 ở đầu cho phút một chữ số.

# DateTimeCheatSheet_Minutes
source: Minutes without leading zeros for single-digit minutes.
vi: Phút không thêm 0 ở đầu cho phút một chữ số.

# DateTimeCheatSheet_SecondsLZero
source: Seconds with leading zeros for single-digit seconds.
vi: Giây có thêm 0 ở đầu cho giây một chữ số.

# DateTimeCheatSheet_Seconds
source: Seconds without leading zeros for single-digit seconds.
vi: Giây không thêm 0 ở đầu cho giây một chữ số.

# DateTimeCheatSheet_MilliSeconds3D
source: Milliseconds represented by full three digits.
vi: Miligiây được biểu diễn bằng 3 chữ số đầy đủ.

# DateTimeCheatSheet_MilliSeconds2D
source: Milliseconds represented only by the first two digit.
vi: Miligiây chỉ bằng 2 chữ số đầu.

# DateTimeCheatSheet_MilliSeconds1D
source: Milliseconds represented only by the first digit.
vi: Miligiây chỉ bằng chữ số đầu.

# CheckBox_RegEx.Content
source: Use regular expressions
vi: Dùng biểu thức chính quy

# CheckBox_MatchAll.Content
source: Match all occurrences
vi: Khớp tất cả vị trí

# CheckBox_Case.Content
source: Case sensitive
vi: Phân biệt chữ hoa thường

# TextBox_ApplyTo.Text
source: Apply to
vi: Áp dụng cho

# DocsButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Documentation
vi: Tài liệu

# DocsButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Documentation
vi: Tài liệu

source: Include files
vi: Bao gồm tệp

source: Include folders
vi: Bao gồm thư mục

source: Include subfolders
vi: Bao gồm thư mục con

# TextBlock_TextFormatting.Text
source: Text formatting
vi: Định dạng văn bản

# ToggleButton_Lowercase.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: lowercase
vi: chữ thường

source: Lowercase
vi: Chữ thường

# ToggleButton_Uppercase.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: UPPERCASE
vi: CHỮ HOA

source: Uppercase
vi: Chữ hoa

# ToggleButton_Titlecase.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Title case
vi: Chữ hoa tiêu đề

source: Title case
vi: Chữ hoa tiêu đề

# ToggleButton_Capitalize.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Capitalize Each Word
vi: Viết hoa từng từ

source: Capitalize each word
vi: Viết hoa từng từ

# ToggleButton_EnumItems.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Enumeration features
vi: Tính năng đánh số

source: Enumeration features
vi: Tính năng đánh số

# SelectAllCheckBox.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Select or deselect all
vi: Chọn hoặc bỏ chọn tất cả

# FilterButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Filter
vi: Lọc

# FilterButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Filter
vi: Lọc

# ShowAll.Text
source: Show all files
vi: Hiển thị tất cả tệp

# ShowOnly.Text
source: Only show files that will be renamed
vi: Chỉ hiển thị các tệp sẽ được đổi tên

# TxtBlock_Original.Text
source: Original
vi: Gốc

# TxtBlock_Renamed.Text
source: Renamed
vi: Đã đổi tên

# TxtBlock_ButtonSettings.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Settings
vi: Cài đặt

source: Settings
vi: Cài đặt

# TxtBlock_ButtonApply.Text
source: Apply
vi: Áp dụng

# ButtonApply.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Apply
vi: Áp dụng

# TxtBlock_ButtonApplyAndClose.Text
source: Apply and close
vi: Áp dụng và đóng

# RegExButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: RegEx help
vi: Trợ giúp RegEx

# RegExButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: RegEx help
vi: Trợ giúp RegEx

# FileCreationButton.[using:Microsoft.UI.Xaml.Automation]AutomationProperties.Name
source: Replace terms help
vi: Trợ giúp điều khoản thay thế

# FileCreationButton.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Replace terms help
vi: Trợ giúp điều khoản thay thế

# ErrorMessage_FileNameTooLong
source: File name is too long
vi: Tên tệp quá dài

# ErrorMessage_InvalidChar
source: File name contains invalid character(s): > < | " : ? * \ /
vi: Tên tệp chứa ký tự không hợp lệ: > < | " : ? * \ /

# RenameParts_FilenameAndExtension.Content
source: Filename + extension
vi: Tên tệp + phần mở rộng

# RenameParts_FilenameOnly.Content
source: Filename only
vi: Chỉ tên tệp

# RenameParts_ExtensionOnly.Content
source: Extension only
vi: Chỉ phần mở rộng

# RandomizerCheatSheet_Alnum
source: Random string with uppercase letters, lowercase letters and 0-9 digits, customized length.
vi: Chuỗi ngẫu nhiên gồm chữ hoa, chữ thường và chữ số 0-9, độ dài tùy chỉnh.

# RandomizerCheatSheet_Alpha
source: Random string with uppercase letters and lowercase letters, customized length.
vi: Chuỗi ngẫu nhiên gồm chữ hoa và chữ thường, độ dài tùy chỉnh.

# RandomizerCheatSheet_Digit
source: Random string with 0-9 digits, customized length.
vi: Chuỗi ngẫu nhiên gồm chữ số 0-9, độ dài tùy chỉnh.

# RandomizerCheatSheet_Title.Text
source: Replace using random values
vi: Thay thế bằng giá trị ngẫu nhiên

# RandomizerCheatSheet_Uuid
source: Random UUID according to v4 specification.
vi: UUID ngẫu nhiên theo đặc tả v4.

source: Random string features
vi: Tính năng chuỗi ngẫu nhiên

# ToggleButton_RandItems.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Random string features
vi: Tính năng chuỗi ngẫu nhiên
